## Handle Categoricat features

## 1. One Hot Encoding

### ** One hot encoding with LESS categories in a feature

In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('titanic_train.csv', usecols=['Sex'])
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [7]:
# one hot encoding
## If there are n features you have to take n-1 features
### Drop one feature as it will simply expain the relation with sex_male

pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [8]:
df=pd.read_csv('titanic_train.csv', usecols=['Embarked'])
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [12]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [13]:
##Lets drop nan values not imp now
df.dropna(inplace=True)

In [14]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [15]:
## at first we had 3 values so we can drop one feature as 2 other
## feature will be able to represent that drop feature so drop_first =True

pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

### **One hot encoding with MANY categories in a feature.

In [16]:
df=pd.read_csv('mercede_train.csv', usecols=['X0','X1','X2','X3','X4','X5','X6'])
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [29]:
df['X1'].value_counts()

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
w      52
z      46
u      37
e      33
m      32
t      31
h      29
f      23
y      23
j      22
n      19
k      17
p       9
g       6
d       3
q       3
ab      3
Name: X1, dtype: int64

In [30]:
# if we use one hot encoding it will create so many features and there 
# will be a huge problem

In [31]:
## Try to take 10 most( or many you want)occuring features and 
## apply one hot encoding to them only.

In [32]:
## taking most 10 frequent categoriess
df.X1.value_counts().sort_values(ascending=False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [33]:
df.X1.value_counts().sort_values(ascending=False).head(10).index

Index(['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o'], dtype='object')

In [34]:
#convert above as list

lst_10=df.X1.value_counts().sort_values(ascending=False).head(10).index
lst_10=list(lst_10)

In [35]:
lst_10

# 10 most frequent categories as list

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [36]:
## Applying one hot encoding for above 10 categories
## For remaining categories just ut 0 or skip it

for categories in lst_10:
    df[categories]=np.where(df['X1']==categories,1,0)

In [38]:
df[lst_10]

      aa  s  b  l  v  r  i  a  c  o
0      0  0  0  0  1  0  0  0  0  0
1      0  0  0  0  0  0  0  0  0  0
2      0  0  0  0  0  0  0  0  0  0
3      0  0  0  0  0  0  0  0  0  0
4      0  0  0  0  1  0  0  0  0  0
...   .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0
4205   0  0  0  0  0  0  0  0  0  1
4206   0  0  0  0  1  0  0  0  0  0
4207   0  0  0  0  0  1  0  0  0  0
4208   0  0  0  0  0  1  0  0  0  0

[4209 rows x 10 columns]

In [39]:
# lets see it for each category now
lst_10.append('X1')

In [41]:
df[lst_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]

## 2. Ordinal number encoding

This encoding is used where rank comes in picture like 

Grading system A-1,B-2,C3,D-4

Experience of batsman A--10 rank is 1,B--5 rank is 2,C--3 rank is 3

Example used in coding ::::::: Weekdays -- mon,tue,wed,thur,fri,sat

In [44]:
import datetime
#create a variable with dates, and from that extract days
#list of date with 20 days from now

df_base = datetime.datetime.today()
df_date_list= [df_base - datetime.timedelta(days=x) for x in range(0,20)]
df=pd.DataFrame(df_date_list)
df.columns = ['Days']
df

                         Days
0  2020-08-21 16:00:44.196012
1  2020-08-20 16:00:44.196012
2  2020-08-19 16:00:44.196012
3  2020-08-18 16:00:44.196012
4  2020-08-17 16:00:44.196012
5  2020-08-16 16:00:44.196012
6  2020-08-15 16:00:44.196012
7  2020-08-14 16:00:44.196012
8  2020-08-13 16:00:44.196012
9  2020-08-12 16:00:44.196012
10 2020-08-11 16:00:44.196012
11 2020-08-10 16:00:44.196012
12 2020-08-09 16:00:44.196012
13 2020-08-08 16:00:44.196012
14 2020-08-07 16:00:44.196012
15 2020-08-06 16:00:44.196012
16 2020-08-05 16:00:44.196012
17 2020-08-04 16:00:44.196012
18 2020-08-03 16:00:44.196012
19 2020-08-02 16:00:44.196012

In [45]:
# Extract the week day

df['week']=df['Days'].dt.day_name()
df.head()

                        Days       week
0 2020-08-21 16:00:44.196012     Friday
1 2020-08-20 16:00:44.196012   Thursday
2 2020-08-19 16:00:44.196012  Wednesday
3 2020-08-18 16:00:44.196012    Tuesday
4 2020-08-17 16:00:44.196012     Monday

In [46]:
############################################################
############################################################

# Crate a dictionary mapping the values to week 

week_map={'Monday':1,
         'Tuesday':2,
         'Wednesday':3,
         'Thursday':4,
         'Friday':5,
         'Saturday':6,
         'Sunday':7}

df['day_ord']=df.week.map(week_map)
df.head()

                        Days       week  day_ord
0 2020-08-21 16:00:44.196012     Friday        5
1 2020-08-20 16:00:44.196012   Thursday        4
2 2020-08-19 16:00:44.196012  Wednesday        3
3 2020-08-18 16:00:44.196012    Tuesday        2
4 2020-08-17 16:00:44.196012     Monday        1

## 3. Count or Frequency encoding

In [47]:
## Is to replace each variable of categorical value with count,
## the is the amount of time the each label appear in the data set

In [48]:
df=pd.read_csv('mercede_train.csv', usecols=['X1','X2'])

In [49]:
df.head()

  X1  X2
0  v  at
1  t  av
2  w   n
3  t   n
4  v   n

In [50]:
### lets see how many columns  one hot encoding adds

pd.get_dummies(df).shape

(4209, 71)

In [51]:
### So above method adds 69 more columns which is very much so we try
### count or frequency encoding

In [52]:
# find the unique labels

for col in df.columns[0:]:
    print(col,' :', len(df[col].unique()), 'labels')

X1  : 27 labels
X2  : 44 labels

In [53]:
#lets try for X2 and obtain the count of each one of the labels
# Cpture the count of each variable in dict that we can map the labels

df.X2.value_counts().to_dict()

{'as': 1659,
 'ae': 496,
 'ai': 415,
 'm': 367,
 'ak': 265,
 'r': 153,
 'n': 137,
 's': 94,
 'f': 87,
 'e': 81,
 'aq': 63,
 'ay': 54,
 'a': 47,
 't': 29,
 'k': 25,
 'i': 25,
 'b': 21,
 'ao': 20,
 'ag': 19,
 'z': 19,
 'd': 18,
 'ac': 13,
 'g': 12,
 'y': 11,
 'ap': 11,
 'x': 10,
 'aw': 8,
 'at': 6,
 'h': 6,
 'an': 5,
 'al': 5,
 'q': 5,
 'av': 4,
 'p': 4,
 'ah': 4,
 'au': 3,
 'aa': 1,
 'ar': 1,
 'l': 1,
 'af': 1,
 'c': 1,
 'am': 1,
 'j': 1,
 'o': 1}

In [54]:
# now replace the each label in X2 by its count

# Mke a dictionary that match each label to the count
df_frequency_map = df.X2.value_counts().to_dict()

In [55]:
# Now replace X2 labels in the data set df

df.X2 = df.X2.map(df_frequency_map)

df.head()

  X1   X2
0  v    6
1  t    4
2  w  137
3  t  137
4  v  137

##### Advantages
not increasing feature space.
##### Disadvantages
It will provide the same weight if freq. are same.

## 4. Target guided ordinal encoding
1. Ordering labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [3]:
df=pd.read_csv('titanic_train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [5]:
## Replave na values with missing

df['Cabin'].fillna('Misiing',inplace=True)
df.head(20)

    Survived    Cabin
0          0  Misiing
1          1      C85
2          1  Misiing
3          1     C123
4          0  Misiing
5          0  Misiing
6          0      E46
7          0  Misiing
8          1  Misiing
9          1  Misiing
10         1       G6
11         1     C103
12         0  Misiing
13         0  Misiing
14         0  Misiing
15         1  Misiing
16         0  Misiing
17         1  Misiing
18         0  Misiing
19         1  Misiing

In [7]:
## Take the first letter to each value

df['Cabin']=df['Cabin'].astype(str).str[0]

In [8]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [10]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [11]:
#Surviving possibility as per the cabin

df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [12]:
#get sorted values

df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [14]:
#get index
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [15]:
#store it in a variable

ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [16]:
# map these labels to a numbers

ordinal_labels2= {k:i for i,k in enumerate (ordinal_labels,0)}

In [17]:
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [18]:
df['Cabi_ordinal_labels']=df['Cabin'].map(ordinal_labels2)

In [19]:
df.head()

   Survived Cabin  Cabi_ordinal_labels
0         0     M                    1
1         1     C                    4
2         1     M                    1
3         1     C                    4
4         0     M                    1

In [20]:
## drop cabin values

## 5. Mean Encoding

In [23]:
#Same as above target encoding 
#find the mean
#store it in a dictionary 

mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [24]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [27]:
df['mean_ordinal_encod']=df['Cabin'].map(mean_ordinal)

In [28]:
df.head()

   Survived Cabin  Cabi_ordinal_labels  mean_ordinal_encod
0         0     M                    1            0.299854
1         1     C                    4            0.593220
2         1     M                    1            0.299854
3         1     C                    4            0.593220
4         0     M                    1            0.299854

In [29]:
### Disadvantage ---- leads to overfitting

## 6.Probability Ratio encoding

In [42]:
df=pd.read_csv('titanic_train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [43]:
## Replave na values with missing

df['Cabin'].fillna('Mising',inplace=True)
df.head()

   Survived   Cabin
0         0  Mising
1         1     C85
2         1  Mising
3         1    C123
4         0  Mising

In [44]:
## Take the first letter to each value

df['Cabin']=df['Cabin'].astype(str).str[0]

In [45]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [46]:
#finding percentage of cabin values as per survived

probability= df.groupby(['Cabin'])['Survived'].mean().sort_values()

In [47]:
prob_df =pd.DataFrame(probability)
prob_df

       Survived
Cabin
T      0.000000
M      0.299854
A      0.466667
G      0.500000
C      0.593220
F      0.615385
B      0.744681
E      0.750000
D      0.757576

In [48]:
prob_df['Died']=1-prob_df['Survived']

In [49]:
prob_df

       Survived      Died
Cabin
T      0.000000  1.000000
M      0.299854  0.700146
A      0.466667  0.533333
G      0.500000  0.500000
C      0.593220  0.406780
F      0.615385  0.384615
B      0.744681  0.255319
E      0.750000  0.250000
D      0.757576  0.242424

In [50]:
# probability of survived/ probability of died

In [51]:
prob_df['Probability_ratio']=prob_df['Survived']/prob_df['Died']

In [52]:
prob_df

       Survived      Died  Probability_ratio
Cabin
T      0.000000  1.000000           0.000000
M      0.299854  0.700146           0.428274
A      0.466667  0.533333           0.875000
G      0.500000  0.500000           1.000000
C      0.593220  0.406780           1.458333
F      0.615385  0.384615           1.600000
B      0.744681  0.255319           2.916667
E      0.750000  0.250000           3.000000
D      0.757576  0.242424           3.125000

In [53]:
prob_df['Probability_ratio'].to_dict()

{'T': 0.0,
 'M': 0.42827442827442824,
 'A': 0.875,
 'G': 1.0,
 'C': 1.4583333333333333,
 'F': 1.6000000000000003,
 'B': 2.916666666666666,
 'E': 3.0,
 'D': 3.125}

In [54]:
prob_encod=prob_df['Probability_ratio'].to_dict()

In [56]:
# map this in dataframe

df['Cabin_encod']=df['Cabin'].map(prob_encod)
df.head(10)

   Survived Cabin  Cabin_encod
0         0     M     0.428274
1         1     C     1.458333
2         1     M     0.428274
3         1     C     1.458333
4         0     M     0.428274
5         0     M     0.428274
6         0     E     3.000000
7         0     M     0.428274
8         1     M     0.428274
9         1     M     0.428274

In [ ]:
## drop cabin column